app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
      redirect_to prototype_path(@comment.prototype_id)
    else
      @prototype = Prototype.find(params[:prototype_id])
      @comment = Comment.new
      @comments = @prototype.comments.includes(:user)
---
INSERT INTO `comments` (`text`, `user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES ('test1', 1, 1, '2022-04-26 02:53:06.438430', '2022-04-26 02:53:06.438430')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1