app/controllers/prototypes_controller.rb

  def show
    @prototype = Prototype.find(params[:id])
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 3 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1

  def update
    @prototype = Prototype.find(params[:id])
    if @prototype.update(prototype_params)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`concept` = '1.5', `prototypes`.`updated_at` = '2022-04-25 09:39:22.753570' WHERE `prototypes`.`id` = 2

  def destroy
    @prototype = Prototype.find(params[:id])
    @prototype.destroy
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 2